---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
source: html/65eb445b-3e23-382e-c164-2b1bfb84ccf0.htm
---
# StructuralSectionRoundBar Members

Creates a new instance of Structural Section Round Bar shape with the associated set of parameters,
 used to attach to structural element.